Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыПроизводныхФинансовыхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыПроизводныхФинансовыхИнструментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Фьючерс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опцион</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спот</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РаботаСЦеннымиБумагамиКлиентСервер/Ext/Module.bsl
Функция РассчитатьРазмерЭмиссииСумма(РазмерЭмиссииШт, Номинал) Экспорт
	
	Возврат РазмерЭмиссииШт * Номинал;	
	
КонецФункции // РассчитатьРазмерЭмиссииСумма

Процедура ОтборДинамическогоСписка(Коды, Объект) Экспорт

	Коды.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Коды.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Объект");
    ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование    = Истина;
    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    ЭлементОтбора.ПравоеЗначение   = Объект.Ссылка;	

КонецПроцедуры // ОтборДинамическогоСписка

Функция РынокПоЦеннойБумаге(ЦеннаяБумага) Экспорт
	
	ТипЦБ = ТипЗнч(ЦеннаяБумага);
	
	Если      ТипЦБ = Тип("СправочникСсылка.Акции") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Акции");
		
	ИначеЕсли ТипЦБ = Тип("СправочникСсылка.Векселя") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Векселя");
		
	ИначеЕсли ТипЦБ = Тип("СправочникСсылка.ДепозитарныеРасписки") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки");	
		
	ИначеЕсли ТипЦБ = Тип("СправочникСсылка.Закладные") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Закладные");
		
	ИначеЕсли ТипЦБ = Тип("СправочникСсылка.ИпотечныеСертификатыУчастия") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия");
	
	ИначеЕсли ТипЦБ = Тип("СправочникСсылка.Облигации") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации");
		
	ИначеЕсли ТипЦБ = Тип("СправочникСсылка.Паи") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Паи");			
		
	ИначеЕсли ТипЦБ = Тип("СправочникСсылка.ПроизводныеФинансовыеИнструменты") Тогда 
		
		СвойстваЦБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЦеннаяБумага, "ТипПроизводногоФинансовогоИнструмента, ТипБазовогоАктива");
		
		Если СвойстваЦБ.ТипПроизводногоФинансовогоИнструмента = ПредопределенноеЗначение("Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс") Тогда	
			Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Фьючерсы");
		ИначеЕсли СвойстваЦБ.ТипПроизводногоФинансовогоИнструмента = ПредопределенноеЗначение("Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион") Тогда
			Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Опционы");
		ИначеЕсли СвойстваЦБ.ТипПроизводногоФинансовогоИнструмента = ПредопределенноеЗначение("Перечисление.ТипыПроизводныхФинансовыхИнструментов.Спот") Тогда
						
			Если СвойстваЦБ.ТипБазовогоАктива = ПредопределенноеЗначение("Перечисление.ТипыБазовыхАктивов.ДрагоценныйМеталл") Тогда
				Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы");
			ИначеЕсли СвойстваЦБ.ТипБазовогоАктива = ПредопределенноеЗначение("Перечисление.ТипыБазовыхАктивов.ВалютнаяПара") Тогда
				Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ВалютныеПары");
	        КонецЕсли;
	
		КонецЕсли;
			
	ИначеЕсли ТипЦБ = Тип("СправочникСсылка.ВалютныеПары") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ВалютныеПары");
		
	ИначеЕсли ТипЦБ = Тип("СправочникСсылка.Доли") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Доли");
		
	Иначе
		Если ЗначениеЗаполнено(ЦеннаяБумага)  Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По типу ценной бумаги " + ТипЦБ + " не удалось определить рынок!");
		КонецЕсли; 
		
		Возврат ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ПустаяСсылка");
		
	КонецЕсли; 
		
КонецФункции // РынокПоЦеннойБумаге

Функция ВидЗадолженностиДивидендыПоЦеннойБумаге(ЦеннаяБумага) Экспорт
	
	ТипЦБ = ТипЗнч(ЦеннаяБумага);
	
	Если      ТипЦБ = Тип("СправочникСсылка.Акции") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции");
		
	ИначеЕсли ТипЦБ = Тип("СправочникСсылка.ДепозитарныеРасписки") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки");	
				
	ИначеЕсли ТипЦБ = Тип("СправочникСсылка.Паи") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи");			
		
	ИначеЕсли ТипЦБ = Тип("СправочникСсылка.ИпотечныеСертификатыУчастия") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия");			
		
	ИначеЕсли ТипЦБ = Тип("СправочникСсылка.Доли") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНачислениюРаспределяемойПрибылиООО");			
		
	Иначе
		Если ЗначениеЗаполнено(ЦеннаяБумага)  Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По типу ценной бумаги " + ТипЦБ + " не удалось определить вид задолженности для денежных средств!");
		КонецЕсли; 
		
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПустаяСсылка");
		
	КонецЕсли;
	
КонецФункции // ВидЗадолженностиДивидендыПоЦеннойБумаге

Функция ТипЦеннойБумагиВЗависимостиОтРынка(Рынок) Экспорт
			
	Если      Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Акции") Тогда
		Возврат  Новый ОписаниеТипов("СправочникСсылка.Акции");
		
	ИначеЕсли Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.Облигации");
		
	ИначеЕсли Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Паи") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.Паи");
		
	ИначеЕсли Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Векселя") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.Векселя");
		
	ИначеЕсли Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Закладные") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.Закладные");
		
	ИначеЕсли Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ИпотечныеСертификатыУчастия");
		
	ИначеЕсли Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ДепозитарныеРасписки");		
		
	ИначеЕсли Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Фьючерсы")
		Или Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Опционы")
		Или Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы") Тогда
		
		Возврат Новый ОписаниеТипов("СправочникСсылка.ПроизводныеФинансовыеИнструменты");		
			
	ИначеЕсли Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ВалютныеПары") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ВалютныеПары");		
		
	ИначеЕсли Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Доли") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.Доли");
				
	Иначе
		Если ЗначениеЗаполнено(Рынок)  Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По рынку " + Рынок + " не удалось определить тип ценной бумаги!");
		КонецЕсли; 
		
		Возврат Новый ОписаниеТипов(Неопределено);
		
	КонецЕсли;
	
КонецФункции // ТипЦеннойБумагиВЗависимостиОтРынка

Функция ЭтоРынокДолговыхЦенныхБумаг(Рынок) Экспорт

	Возврат
		Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации")
			Или Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Векселя");
	
КонецФункции // ЭтоРынокДолговыхЦенныхБумаг

Процедура НастроитьПолеACCINT(ЦеннаяБумага, Дата, Элемент) Экспорт

	МассивОблигацийСРасчетнымКупоном = РаботаСЦеннымиБумагами.ПолучитьОблигацииСРасчетнымКупономНаДату(Дата);
	Если МассивОблигацийСРасчетнымКупоном.Найти(ЦеннаяБумага) <> Неопределено Тогда
	
		Элемент.Заголовок = "ACCINT расчетный";
		Элемент.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
	
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьСообщениеОРасчетномКупоне(Форма) Экспорт 

	ЦеннаяБумага = Неопределено;
	Если Форма.Параметры.Отбор.Свойство("ЦеннаяБумага", ЦеннаяБумага) Тогда
		Если ТипЗнч(ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда
			
			ДатыПримененияРасчетногоКупона = РаботаСЦеннымиБумагами.ПолучитьДатыПримененияРасчетногоКупона(ЦеннаяБумага);
			Если ДатыПримененияРасчетногоКупона <> Неопределено Тогда
			
				ТекстСообщенияОРасчетномКупоне = "По этой облигации купон рассчитывается";
				Если ДатыПримененияРасчетногоКупона.ДатаНачала <> '00010101' Тогда
					ТекстСообщенияОРасчетномКупоне = ТекстСообщенияОРасчетномКупоне + " с " + Формат(ДатыПримененияРасчетногоКупона.ДатаНачала, "ДФ=dd.MM.yyyy");
				КонецЕсли;
				Если ДатыПримененияРасчетногоКупона.ДатаОкончания <> '00010101' Тогда
					ТекстСообщенияОРасчетномКупоне = ТекстСообщенияОРасчетномКупоне + " по " + Формат(ДатыПримененияРасчетногоКупона.ДатаОкончания, "ДФ=dd.MM.yyyy");
				КонецЕсли;
				
				СообщенияОРасчетномКупонеЭлемент = Форма.Элементы.Добавить("СообщениеОРасчетномКупоне", Тип("ДекорацияФормы"), Форма);
				СообщенияОРасчетномКупонеЭлемент.Заголовок = ТекстСообщенияОРасчетномКупоне;
				СообщенияОРасчетномКупонеЭлемент.ЦветТекста = Новый Цвет(255, 0, 0);
				
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

Функция ЭтоРынокЦенныхБумагСНоминалом(Рынок) Экспорт
	
	РынкиЦенныхБумагСНоминалом = Новый Массив;
	РынкиЦенныхБумагСНоминалом.Добавить(ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Акции"));
	РынкиЦенныхБумагСНоминалом.Добавить(ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Векселя"));
	РынкиЦенныхБумагСНоминалом.Добавить(ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации"));
	
	Возврат Не РынкиЦенныхБумагСНоминалом.Найти(Рынок) = Неопределено;
	
КонецФункции
